SCAN_RESPONSE = {
  "id": "cmhqaebxl002opl01p3gs1p24",
  "userId": 0,
  "guestId": "b03bbeae-c18d-45da-883d-14fa084e504b",
  "type": "food",
  "status": "completed",
  "name": "Печенье сахарное «Юбилейная песенка» шоколадное",
  "photoUrl": "https://storage.yandexcloud.net/pomelo/scans/904a9a62-ffd8-40c2-baa5-94a9c0e70d83.jpeg",
  "composition": "мука пшеничная, сахар, растительные масла, какао-порошок, влагоудерживающая добавка (глицерин), крахмал кукурузный, вода, продукты яичные, разрыхлитель (карбонат аммония), соль, эмульгатор (соевый лецитин), ароматизатор пищевой (ванилин), антиокислитель (пиросульфит натрия)",
  "energyValue": {
    "fat": 20.2,
    "kcal": 453,
    "weight": "100г",
    "protein": 7.3,
    "carbohydrates": 59.9
  },
  "analysis": {
    "type": "food",
    "hasSugar": True,
    "allergens": [
      "продукты яичные",
      "мука пшеничная",
      "соевый лецитин"
    ],
    "hasFlavors": False,
    "hasColoring": False,
    "healthIndex": 64,
    "ingredients": [
      {
        "id": 88,
        "code": "E223",
        "name": "Пиросульфит натрия",
        "usage": "Нет данных",
        "danger": 3,
        "origins": [
          "Синтетическое происхождение"
        ],
        "synonyms": [
          "E 223",
          "E-223",
          "E223",
          "sodium metabisulfite",
          "sodium pyrosulphate",
          "sodium pyrosulphite",
          "Е 223",
          "Е-223",
          "Е223",
          "метабисульфит натрия",
          "натрия метабисульфит",
          "натрію метабісульфіт",
          "пиросульфит натрия",
          "піросульфіт натрію"
        ],
        "categories": [
          "Отбеливатели",
          "Улучшители муки и хлеба",
          "Консерванты"
        ],
        "healthHarm": "Нет данных",
        "description": "Нет данных",
        "legislation": "Нет данных",
        "referenceUrl": "https://dobavkam.net/additives/e223",
        "healthBenefit": "Нет данных"
      },
      {
        "id": 436,
        "code": "sugar",
        "name": "Сахар",
        "usage": "Кондитерские изделия, напитки, консервация. Используется в фармацевтике для таблеток",
        "danger": 2,
        "origins": [
          "Растительное происхождение",
          "Искусственное происхождение"
        ],
        "synonyms": [
          "сахароза",
          "тростниковый сахар",
          "свекловичный сахар",
          "кристаллический сахар"
        ],
        "categories": [
          "Подсластители"
        ],
        "healthHarm": "Эпидемиологические исследования связывают избыток с ожирением (35% взрослых в мире), диабетом 2 типа (риск возрастает на 26% при потреблении >18ч.л/день) и кариесом. Способствует формированию пищевой зависимости. Однако в типичных количествах вред умеренный, и исследования показывают, что умеренное потребление не является критически опасным",
        "description": "Кристаллический углевод, получаемый из сахарной свеклы или тростника",
        "legislation": "Нет данных",
        "referenceUrl": "",
        "healthBenefit": "Быстрый источник энергии (4 ккал/г). Используется мозгом как основное топливо. При употреблении сладкого наш мозг вырабатывает дофамин – гормон удовольствия."
      },
      {
        "id": 419,
        "code": "E1422",
        "name": "Дикрахмаладипат ацетилированный",
        "usage": "В пищевой промышленности добавка E1422 применяется в качестве загустителя, наполнителя, стабилизатора и эмульгатора. Модифицированный крахмал помогает отрегулировать консистенцию продукции, применяется как влагоудерживающее, желирующее вещество, глазирователь. Его активно используют в производстве: кисломолочных продуктов – йогуртов, молочных напитков, сметаны; творожного и плавленого сыров; соусов, кетчупов; быстрозавариваемых каш, сухих завтраков; набухающей панировки и экструдированных продуктов; маринованных огурцов, корнишонов; консервированных фруктов и фруктовых начинок для откртых пирогов; консервированных супов; мясных продуктов низкой стоимости из сырья второго сорта – модифицированные крахмалы требуются для связывания свободной влаги, выделяемой при нагреве. Также ацетилированный дикрахмаладипат включают в состав консервированного десткого питания (для детей в возрасте до 3 лет), однако в дозировке не более 60г на 1кг веса.",
        "danger": 2,
        "origins": [
          "Растительное происхождение",
          "Искусственное происхождение"
        ],
        "synonyms": [
          "E 1422",
          "E-1422",
          "E1422",
          "Е 1422",
          "Е-1422",
          "Е1422",
          "ацетилированного крахмала адипат",
          "ацетилированого крахмала адипат",
          "дикрахмалоадипат ацетилированный",
          "крахмал Е1422",
          "крахмал картофельный модифицированный",
          "крахмал модифифициорованный Е 1422",
          "крахмал модифицированный",
          "крахмал модифицированный Е1422",
          "модифицированный крахмал кукурузный"
        ],
        "categories": [
          "Загустители",
          "Эмульгаторы",
          "Стабилизаторы"
        ],
        "healthHarm": "Модифицированный крахмал в целом относится к числу безопасных добавок. Однако избыточное потребление вещества может спровоцировать вздутие живота, диарею. Есть информация о том, что модифицированные крахмалы наносят вред поджелудочной железе и могут вызывать опасное заболевание — панкреонекроз. Официальные исследования эти данные не подтверждают. В то же время для добавки E1422 не установлено предельных норм потребления.",
        "description": "Пищевая добавка E1422 (дикрахмаладипат ацетилированный) представляет собой крахмал, модифицированный при помощи ангидридов уксусной кислоты и адипиновой кислоты. Это пищевой крахмал, у которого одна или более начальных характеристик изменены путём специальной обработки. Благодаря модификации он может противостоять высоким температурам. Модифицированный крахмал – продукт многоступенчатого синтеза. На первом этапе производства нативный крахмал взаимодействует с бифункциональными реагентами (адипиновая кислота или ее ангидрид). В результате образуется дикрахмаладипат. При его дополнительной обработке винилацетатом или ангидридом уксусной кислоты образуется ацетилированный дикрахмаладипат. Пищевая добавка E1422 и модифицированные крахмалы в целом не являются генно-модифицированными продуктами. Сам крахмал и его модификации могут содержать только следы, отдельные незначительные фрагменты измененной ДНК, если он был произведен из генно-модифицированного сырья. Модифицированный крахмал хорошо растворяется в горячей воде, образуя клейстер. В холодной воде имеет среднюю растворимость. В спирте и других органических жидкостях не растворяется. Пищевая добавка E1422 устойчива к ретроградации и разрезу, механическим нагрузкам, оттаиванию-замораживанию, воздействию низкого pH. Также крахмал E1422 выдерживает термическую обработку и не утрачивает свойств при длительном хранении. Основные характеристики пищевой добавки E1422: Цвет – белый или желтоватый. Запах – слабый уксусный. Вкус – нет. Консистенция – порошок, состоящий из гранул, хлопьев аморфного порошка, грубых частиц (зависит от метода сушки - если крахмал обработан нагреванием в присутствии кислоты или щелочи, появляется незначительная дефрагментация).",
        "legislation": "Пищевая добавка E1422 разрешена для использования в пищевой промышленности большинства стран как безопасная для здоровья человека. Она является разрешенной в России, странах Евросоюза, Японии, Австралии. При этом модифицированный крахмал запрещен в США. В Codex Alimentarius стабилизатор E1422 имеет допуск в 11 стандартах: рыбные, грибные, овощные консервы, ароматизированные кисломолочные продукты, бульоны GMP.",
        "referenceUrl": "https://dobavkam.net/additives/e1422",
        "healthBenefit": "В пищеварительном тракте пищевая добавка E1422 расщепляется по принципу нативного крахмала, но усваивается хуже, как и все вещества с измененной структрой."
      },
      {
        "id": 285,
        "code": "E503",
        "name": "Карбонаты аммония",
        "usage": "Нет данных",
        "danger": 2,
        "origins": [
          "Животное происхождение",
          "Искусственное происхождение"
        ],
        "synonyms": [
          "E 503",
          "E-503",
          "E503",
          "ammonium carbonate",
          "ammonium hydrogen carbonate",
          "Е 503",
          "Е-503",
          "Е503",
          "аммония гидрокарбонат",
          "гидрокарбонат аммония",
          "карбонат аммония",
          "соли углеаммонийные",
          "соль углеаммонийная",
          "углеаммонийная соль"
        ],
        "categories": [
          "Разрыхлители",
          "Регуляторы кислотности"
        ],
        "healthHarm": "Нет данных",
        "description": "Нет данных",
        "legislation": "Нет данных",
        "referenceUrl": "https://dobavkam.net/additives/e503",
        "healthBenefit": "Нет данных"
      },
      {
        "id": 434,
        "code": "wheat_flour",
        "name": "Мука пшеничная",
        "usage": "Выпечка, соусы, панировка. Основа хлеба, макарон, кондитерских изделий. Используется как загуститель в промышленных продуктах",
        "danger": 1,
        "origins": [
          "Растительное происхождение"
        ],
        "synonyms": [
          "пшеничная мука",
          "мука высшего сорта",
          "хлебопекарная мука",
          "ржаная мука",
          "обойная мука",
          "мука из твердой пшеницы для макаронных изделий высшего сорта",
          "мука из твердой пшеницы"
        ],
        "categories": [
          "Основные ингредиенты",
          "Злаки"
        ],
        "healthHarm": "У рафинированной муки высокий гликемический индекс (около 70) может способствовать резким скачкам сахара. Глютен вызывает целиакию у 1% населения. Избыток связан с ожирением и диабетом 2 типа",
        "description": "Измельченные зерна пшеницы. Основной ингредиент хлебобулочных изделий",
        "legislation": "Нет данных",
        "referenceUrl": "",
        "healthBenefit": "Источник углеводов для энергии. Цельнозерновая мука содержит клетчатку, витамины группы B и минералы. Участвует в поддержании микрофлоры кишечника"
      },
      {
        "id": 440,
        "code": "vegetable_oil",
        "name": "Растительное масло",
        "usage": "Жарка, заправка салатов, консервация. Используется в маргаринах",
        "danger": 1,
        "origins": [
          "Растительное происхождение"
        ],
        "synonyms": [
          "подсолнечное масло",
          "масло растительное",
          "масло подсолнечное",
          "оливковое масло",
          "кукурузное масло",
          "масло соевое",
          "соевое масло"
        ],
        "categories": [
          "Жиры"
        ],
        "healthHarm": "Омега-6 в избытке провоцирует воспаление. При нагреве выше 180°C образуются токсичные альдегиды. Рафинированное масло теряет полезные вещества. В умеренных количествах риск минимален",
        "description": "Масло, извлеченное из семян или плодов растений",
        "legislation": "Нет данных",
        "referenceUrl": "",
        "healthBenefit": "Источник витамина E и ненасыщенных жиров. Омега-6 в подсолнечном масле снижает холестерин"
      }
    ],
    "hasPreservatives": True,
    "additivesDangerIndex": 36
  },
  "aiAnalysis": "Это треш lorem ipsum",
  "createdAt": "2025-11-08T12:54:55.209Z",
  "updatedAt": "2025-11-08T12:54:55.209Z"
}